/* --------------------------------------------------------------------------
 * .text — исполняемый код
 * -------------------------------------------------------------------------- */
__attribute__((used))
void main_loop(void) {
    while (1);
}


/* --------------------------------------------------------------------------
 * .rodata — константы только для чтения
 * -------------------------------------------------------------------------- */
__attribute__((used))
const char ro_message[] = "This is .rodata";

__attribute__((used))
const unsigned int ro_values[3] = {0x44444444, 0x55555555, 0x66666666};


/* --------------------------------------------------------------------------
 * .data — инициализированные глобальные переменные
 * -------------------------------------------------------------------------- */
__attribute__((used))
unsigned int data_word = 0xFFFFFFFF;

__attribute__((used))
unsigned int data_buff[3] = {0x11111111, 0x22222222, 0x33333333};


/* --------------------------------------------------------------------------
 * .bss — неинициализированные переменные
 * -------------------------------------------------------------------------- */
__attribute__((used))
unsigned int bss_counter;

__attribute__((used))
unsigned int bss_area[3];


int main(void) {
    main_loop();
}
